In [17]:
# imports
import pandas as pd
import matplotlib.pyplot

In [25]:
anonymized_data = pd.read_csv('../data/anonymized_shuffled_phase2.csv')
public_data = pd.read_excel('../data/public_data_register_phase2.xlsx')

In [19]:
!pip3 install xlrd

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: xlrd in /home/gregkoncz/.local/lib/python3.8/site-packages (1.2.0)

In [26]:
public_data.head()

,name,sex,dob,zip,citizenship,marital_status,last_voted
0,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1
1,"el-Asmar, Hasan",Male,1995-02-18,2100,Denmark,Never married,1
2,"Widaa, Cameron",Male,1996-08-24,2300,Denmark,Never married,1
3,"Santos, Jose",Male,2000-05-16,2300,Denmark,Never married,1
4,"Buczynski, Elizabeth",Female,1999-06-03,2300,Denmark,Never married,1

In [27]:
anonymized_data.head()

,sex,evote,age,zip,education,citizenship,party
0,Male,1,30.768506,2400,Vocational Education and Training (VET),Denmark,Green
1,Female,0,47.177024,2400,Vocational Education and Training (VET),Denmark,Green
2,Female,1,46.697183,2400,Vocational bachelors educations,Denmark,Red
3,Female,0,41.181924,2300,Primary education,Denmark,Green
4,Female,0,57.105226,2200,Vocational Education and Training (VET),Not danish,Green

In [28]:
anonymized_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   sex          200 non-null    object
 1   evote        200 non-null    int64
 2   age          200 non-null    float64
 3   zip          200 non-null    int64
 4   education    200 non-null    object
 5   citizenship  200 non-null    object
 6   party        200 non-null    object
dtypes: float64(1), int64(2), object(4)
memory usage: 11.1+ KB

In [29]:
public_data['encoded_citizenship'] = public_data['citizenship'].apply(lambda x: 'Denmark' if x == 'Denmark' else 'Not danish')

In [30]:
public_data = public_data[public_data['last_voted'] != 2]
public_data['evote'] = public_data['last_voted']
public_data['detailed_citizenship'] = public_data['citizenship']
public_data['citizenship'] = public_data['encoded_citizenship']

## Merge stuff

In [31]:
merged_df = public_data.merge(anonymized_data, on = ['sex', 'evote', 'citizenship', 'zip'], how = 'outer')

In [32]:
merged_df.shape

(12448, 13)

In [33]:
merged_df.head()

,name,sex,dob,zip,citizenship,marital_status,last_voted,encoded_citizenship,evote,detailed_citizenship,age,education,party
0,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,37.348805,Vocational bachelors educations,Green
1,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,29.298145,Vocational bachelors educations,Green
2,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,39.542624,Vocational Education and Training (VET),Red
3,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,28.171254,Vocational Education and Training (VET),Green
4,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,21.611027,Primary education,Green

In [37]:
merged_df['calculated_age'] = merged_df['dob'].apply(lambda x: 2020 - x.year)

In [38]:
merged_df.head()

,name,sex,dob,zip,citizenship,marital_status,last_voted,encoded_citizenship,evote,detailed_citizenship,age,education,party,calculated_age
0,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,37.348805,Vocational bachelors educations,Green,24
1,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,29.298145,Vocational bachelors educations,Green,24
2,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,39.542624,Vocational Education and Training (VET),Red,24
3,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,28.171254,Vocational Education and Training (VET),Green,24
4,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,21.611027,Primary education,Green,24

In [40]:
import numpy as np

In [43]:
merged_df['age_diff'] = merged_df['calculated_age'] - merged_df['age']
merged_df['age_diff'] = merged_df['age_diff'].apply(np.abs)
merged_df.head()

,name,sex,dob,zip,citizenship,marital_status,last_voted,encoded_citizenship,evote,detailed_citizenship,age,education,party,calculated_age,age_diff
0,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,37.348805,Vocational bachelors educations,Green,24,13.348805
1,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,29.298145,Vocational bachelors educations,Green,24,5.298145
2,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,39.542624,Vocational Education and Training (VET),Red,24,15.542624
3,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,28.171254,Vocational Education and Training (VET),Green,24,4.171254
4,"al-Fawaz, Sabaah",Male,1996-08-23,2200,Denmark,Never married,1,Denmark,1,Denmark,21.611027,Primary education,Green,24,2.388973

In [45]:
merged_df = merged_df[merged_df['age_diff'] < 8]
merged_df.shape

(3623, 15)

In [51]:
merged_df[['sex', 'citizenship', 'evote', 'zip', 'name']].groupby(['sex', 'citizenship', 'evote', 'zip']).nunique()
## I think where the count for name is one here, that should be a match

                               name
sex    citizenship evote zip
Female Denmark     0     2100    51
                         2200    70
                         2300    87
                         2400   120
                   1     2100    21
                         2200    38
                         2300    37
                         2400    33
       Not danish  0     2100     2
                         2200     4
                         2300     3
                         2400    11
                   1     2200     1
                         2400     1
Male   Denmark     0     2100    37
                         2200    69
                         2300    62
                         2400    97
                   1     2100    25
                         2200    20
                         2300    34
                         2400    45
       Not danish  0     2200     4
                         2400     7
                   1     2100     1
                         2400     5